exp_3_node/logs5_run17/lr_1_app3_25rps_wrk.log
Running 30s test @ http://10.99.72.209/?loopCount=25&base=6&exp=6
  1 threads and 1 connections

  Thread calibration: mean lat.: 691.004ms, rate sampling interval: 2473ms

-----------------------------------------------------------------------
Test Results @ http://10.99.72.209/?loopCount=25&base=6&exp=6 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.86s   803.83ms   4.33s    62.76%
    Req/Sec    20.88      0.60    22.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.83s 
 75.000%    3.56s 
 90.000%    3.89s 
 99.000%    4.33s 
 99.900%    4.34s 
 99.990%    4.34s 
 99.999%    4.34s 
100.000%    4.34s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1412.095     0.000000            1         1.00
    1778.687     0.100000           43         1.11
    2082.815     0.200000           86         1.25
    2295.807     0.300000          129         1.43
    2488.319     0.400000          171         1.67
    2826.239     0.500000          215         2.00
    3102.719     0.550000          235         2.22
    3174.399     0.600000          257         2.50
    3266.559     0.650000          278         2.86
    3428.351     0.700000          299         3.33
    3559.423     0.750000          321         4.00
    3633.151     0.775000          331         4.44
    3661.823     0.800000          342         5.00
    3702.783     0.825000          354         5.71
    3751.935     0.850000          363         6.67
    3860.479     0.875000          375         8.00
    3872.767     0.887500          381         8.89
    3889.151     0.900000          385        10.00
    3950.591     0.912500          391        11.43
    4085.759     0.925000          395        13.33
    4136.959     0.937500          404        16.00
    4136.959     0.943750          404        17.78
    4159.487     0.950000          406        20.00
    4255.743     0.956250          409        22.86
    4288.511     0.962500          411        26.67
    4296.703     0.968750          415        32.00
    4296.703     0.971875          415        35.56
    4325.375     0.975000          420        40.00
    4325.375     0.978125          420        45.71
    4325.375     0.981250          420        53.33
    4329.471     0.984375          423        64.00
    4329.471     0.985938          423        71.11
    4329.471     0.987500          423        80.00
    4329.471     0.989062          423        91.43
    4329.471     0.990625          423       106.67
    4333.567     0.992188          425       128.00
    4333.567     0.992969          425       142.22
    4333.567     0.993750          425       160.00
    4333.567     0.994531          425       182.86
    4333.567     0.995313          425       213.33
    4337.663     0.996094          426       256.00
    4337.663     0.996484          426       284.44
    4337.663     0.996875          426       320.00
    4337.663     0.997266          426       365.71
    4337.663     0.997656          426       426.67
    4341.759     0.998047          427       512.00
    4341.759     1.000000          427          inf
#[Mean    =     2862.301, StdDeviation   =      803.832]
#[Max     =     4337.664, Total count    =          427]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  641 requests in 30.00s, 195.31KB read
Requests/sec:     21.37  
Transfer/sec:      6.51KB